Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes
The SectionMarkTagsAttributes class contains attributes for section mark tags.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.TagA1
The tag A1 of a mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.TagA2
The tag A2 of a mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.TagA3
The tag A3 of a mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.TagA4
The tag A4 of a mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.TagA5
The tag A5 of a mark.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.#ctor
Creates a new mark tags attributes instance.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.#ctor(Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagAttributes)
Creates a new mark tags attributes instance.
tagA1: The tag at place A1.
tagA2: The tag at place A2.
tagA3: The tag at place A3.
tagA4: The tag at place A4.
tagA5: The tag at place A5.

Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.